Problem statement1

In [ ]:
SELECT
    id,
    tenure,
    designation,
    salary,
    CASE
        WHEN tenure < 2 THEN 20
        WHEN tenure >= 2 AND tenure <= 10 THEN 30
        WHEN tenure > 10 THEN 40
    END AS extra_vacation
FROM
    employees;

Problem statement 2

In [ ]:
CREATE TABLE temperature (
    id INT PRIMARY KEY,
    date DATE,
    location STRING,
    temperature_celsius DECIMAL(5, 2)
);

SELECT State, MAX(Temperature) AS MaxTemperature
FROM temperature
GROUP BY State;

Problem statement 3

In [ ]:
CREATE TABLE student_marks (
    Name STRING,
    Marks MAP<STRING, INT>
);

1. SELECT Name
FROM student_marks
WHERE Marks['Maths'] > 90;

2.SELECT Name, Marks['Physics'] AS PhysicsMarks
FROM student_marks;

3.SELECT Name, GREATEST(Marks['Maths'], Marks['Physics']) AS MaxSubjectMarks
FROM student_marks;

4.SELECT Name,
    (Marks['Maths'] + Marks['Physics']) / 2.0 AS AverageMarks
FROM student_marks;

5.SELECT Name,
    ((Marks['Maths'] + Marks['Physics']) / 200) * 100 AS PercentageMarks
FROM student_marks;

Problem statement 4

In [ ]:
CREATE TABLE student_info (
    Name STRING,
    Marks MAP<STRING, INT>,
    Address STRUCT<doorNo INT, Location STRING, Pincode INT>
);

1.SELECT Name
FROM student_info
WHERE Address.Location = 'Banashankari';

2.SELECT COUNT(*) AS TotalCount
FROM student_info
WHERE Address.Pincode = 560001;